evaldoc/app/Controllers/Admin/UsuarioController.php

SELECT *
FROM `usuarios`
ORDER BY `id` DESC
---
    public function index()
    {
        $usuarios = $this->usuario->orderBy('id', 'desc')->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = 'dist'
---
    public function show($id = null)
    {
        $usuario = $this->usuario->find($id);

INSERT INTO `usuarios` (`rol`, `codigo`, `nombre`, `apaterno`, `amaterno`, `email`, `password`, `foto`, `sexo`, `bio`, `created_at`, `updated_at`) VALUES ('estudiante', '2301D26', 'Edgar', 'Degante', 'Aguilar', 'edgar.degante@gmail.com', '$2y$10$wCTaE0wA7Wv7xmlLA/GrpORdi2U45YHEOretWKqp9iB0wwtGId16m', '', 'Hombre', 'djasdjkkasjdkljasdkjaksdjlkas', '2023-05-15 00:18:57', '2023-05-15 00:18:57')
---
    public function create()
    {
        $inputs = $this->validate([
            'codigo'        => 'required|min_length[2]|max_length[10]',
            'nombre'        => 'required|min_length[2]|max_length[50]'
        ]);

        if (!$inputs) {
            return view('admin/usuarios/create', ['validation' => $this->validator]);
        }

        $this->usuario->save([
            'rol'       => $this->request->getVar('rol'),
            'codigo'    => $this->request->getVar('codigo'),
            'nombre'    => $this->request->getVar('nombre'),
            'apaterno'  => $this->request->getVar('apaterno'),
            'amaterno'  => $this->request->getVar('amaterno'),
            'email'     => $this->request->getVar('email'),
            'password'  => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'foto'      => $this->request->getVar('foto'),
            'sexo'      => $this->request->getVar('sexo'),
            'bio'       => $this->request->getVar('bio')
        ]);